**Regrading the usage of a unit test insted of an integration test**

To be able to reproduce this error using a integration test (using a real `tf` file), I would need to use an external module call, so that terraform can "solve" the unknown value for the versioning.

Sample tf file

```terraform
locals {
  name = random_string.bucket_name.result
}

resource "random_string" "bucket_name" {
  length  = 5
  upper   = false
  number  = true
  lower   = true
  special = false
}

module "storage" {
  source     = "terraform-google-modules/cloud-storage/google"
  version    = "= 1.7.2"
  project_id = "tst-project"
  location   = "US"
  names      = [local.name]
  prefix     = "tst-bucket"
  versioning = { (local.name) = true }
}
```

Trying to run this file in the integration test I always get this error:


```
            Error: Failed to download module

            Could not download module "storage"
            (example_unknown_storage_values_remote_module.tf:42) source code from
            "git::https://github.com/terraform-google-modules/terraform-google-cloud-storage?ref=v1.7.2":
            error downloading
            'https://github.com/terraform-google-modules/terraform-google-cloud-storage?ref=v1.7.2':
            git must be available and on the PATH.


            stdout=Initializing modules...
            Downloading terraform-google-modules/cloud-storage/google 1.7.2 for storage...
```  

but in nthe environment I am testing
**git is available**
and
**git is on the PATH**

I got this error both in my machine and in cloud shell.

if if try to do a normal `terraform plan` with the same code I got:

```console
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.bucket_name will be created
  + resource "random_string" "bucket_name" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage.google_storage_bucket.buckets[0] will be created
  + resource "google_storage_bucket" "buckets" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = "tst-project"
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = (known after apply)
          + method          = (known after apply)
          + origin          = (known after apply)
          + response_header = (known after apply)
        }

      + encryption {
          + default_kms_key_name = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```


If I try to use a local module or if I try to inline the module code I get a blocking error:

```console
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

Error: Invalid for_each argument

  on terraform-google-cloud-storage/main.tf line 33, in resource "google_storage_bucket" "buckets":
  33:   for_each = local.names_set

The "for_each" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the for_each depends on.
```

`names_set` is crated from the array with the random value for the name.

https://github.com/terraform-google-modules/terraform-google-cloud-storage/blob/9f6085e671eea558585f4c5027bd94f1bcdd4a11/main.tf#L33

```terraform

locals {
...
  names_set    = toset(var.names)
}
...
resource "google_storage_bucket" "buckets" {
  for_each = local.names_set
...
  versioning {
    enabled = lookup(
      var.versioning,
      lower(each.value),
      false,
    )
  }
...
````
```
 

Because of these issues I choose to do an unit test for this fix.